tutorials/precice/from_tut/mono/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall
    {
        type            patch;
        nFaces          200;
        startFace       14164;
    }
    atmosphere
    {
        type            patch;
        nFaces          200;
        startFace       14364;
    }
    inlet
    {
        type            patch;
        nFaces          36;
        startFace       14564;
    }
    outlet
    {
        type            patch;
        nFaces          36;
        startFace       14600;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          14400;
        startFace       14636;
    }
)

// ************************************************************************* //
