tutorials/precice/from_tut/mono/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../../../../../library/precice_configs/of_zoomy_bidirectional.xml";

participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh;
    patches           (outlet);
    
    readData
    (
      Pressure
      VelocityBack
      AlphaBack
    );
    
    writeData
    (
      PressureBack
      Velocity
      Alpha
    );
  };
};

FF
{
  nameP   p_rgh;
  nameAlpha alpha.water;
}
